In [1]:
import numpy as np
import pandas as pd
from pyspark import SparkContext
from pyspark.sql import SQLContext, Row
import matplotlib.pyplot as plt
import pyspark.sql.functions as F
from pyspark.sql.functions import when, udf, col, regexp_replace
from pyspark.sql.types import DoubleType,IntegerType, StringType

In [2]:
sc = SparkContext( 'local' )  
sqlCtx = SQLContext( sc )

In [3]:
df = sqlCtx.read.csv('data/grade.csv', header=True, inferSchema=True)
df.show()

+-----+----+-----+----+----+
| 학년|과목| 결과|중간|기말|
+-----+----+-----+----+----+
|1학년|국어| 좋음|  80|  90|
|1학년|국어| 나쁨|  50|  40|
|1학년|국어| 나쁨|  20|  50|
|1학년|수학| 좋음|  83|  95|
|1학년|수학| 좋음|  93|  86|
|2학년|국어| 나쁨|  44|  65|
|2학년|국어| 좋음|  95|  98|
|2학년|수학| 좋음|  96|  99|
|2학년|수학| 나쁨|  57|  69|
+-----+----+-----+----+----+

In [4]:
df.groupBy('학년').mean().show()

+-----+---------+---------+
| 학년|avg(중간)|avg(기말)|
+-----+---------+---------+
|2학년|     73.0|    82.75|
|1학년|     65.2|     72.2|
+-----+---------+---------+

In [5]:
df.groupBy('학년', '과목').sum('중간').toPandas()

    학년  과목  sum(중간)
0  2학년  수학      153
1  1학년  수학      176
2  1학년  국어      150
3  2학년  국어      139

In [6]:
df.groupBy('학년').sum('중간','기말').toPandas()

    학년  sum(중간)  sum(기말)
0  2학년      292      331
1  1학년      326      361

In [7]:
df.groupBy('학년').max('중간').toPandas()

    학년  max(중간)
0  2학년       96
1  1학년       93

In [8]:
df.groupBy('학년').min('기말').toPandas()

    학년  min(기말)
0  2학년       65
1  1학년       40

In [9]:
df.groupBy('학년').agg(F.sum('중간').alias('중간고사 총합'), F.mean('중간').alias('중간고사 평균')).show()

+-----+-------------+-------------+
| 학년|중간고사 총합|중간고사 평균|
+-----+-------------+-------------+
|2학년|          292|         73.0|
|1학년|          326|         65.2|
+-----+-------------+-------------+